app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    respond_with Entry.all

UPDATE "entries" SET "winner" = ?, "created_at" = ?, "updated_at" = ? WHERE "entries"."id" = 11  [["winner", true], ["created_at", Thu, 08 Aug 2013 12:09:43 UTC +00:00], ["updated_at", Thu, 08 Aug 2013 12:09:43 UTC +00:00]]
---
  def update
    params.permit!
    respond_with Entry.update(params[:id], params[:entry])